{
  "generatedAt": "2026-02-06T02:29:43.332Z",
  "searchPatterns": [
    {
      "name": "japanese_entries_kanji",
      "description": "Unique values from collections/japanese/words/*.json entries[].kanji.",
      "sources": [
        "collections/japanese/words"
      ],
      "unique_words_count": 1359,
      "unique_words": ["EV","Wi-Fi","アイスクリーム","アカウント","アプリ","イス","イヤホン","イライラ","いる","インセクト","ウイルス","ウインド","ウロウロ","エレクトリック","エレベーター","オウム","オウムガイ","おすすめ","オレンジ","お金","お茶","お釣り","カード","ガード","カイロス","ガス","カチカチ","かばん","カフェ","カメラ","カラ","ガラ","カラー","ガラガラ","カレー","カンガルー","キーボード","きつい","キャタピラー","キャップ","ギャロップ","キャンディ","きらきら","キラキラ","キング","クイーン","グチャグチャ","クッキー","クラス","クラブ","グレープ","ケーキ","ケーシー","ケーブル","ゲーム","ゲンガー","ケンタウロス","コイル","ゴー","ゴースト","コート","コード","コーヒー","ゴール","ゴールド","ゴーレム","コクーン","コツコツ","コピー","ゴロゴロ","コンビニ","コンピューター","ご飯","サービス","サイ","サイズ","さいたま市","サイト","サラサラ","サラダ","サンダー","サンド","サンドイッチ","シー","シーン","シェル","ジャーン","ジャケット","シャツ","シャワー","ジュース","ジュゴン","ショップ","スーツ","スーパー","スープ","スカート","ズキズキ","スター","ずっと","ステーキ","ストライク","スナック","スニーカー","ズバ","スピア","スピーカー","スポーツ","ズボン","スマートフォン","スマホ","スリープ","する","セーター","セール","セル","ソース","ソーセージ","ソファ","ソフト","タオル","ダグ","タクシー","ダック","だるい","た形","チーズ","チーム","チケット","チップ","チュウ","チョコレート","チラチラ","ツー","つまらない","ティー","ディグ","データ","テーブル","できる","デザート","デザイン","テスト","テレビ","て形","ドア","トイレ","ドードー","ドーン","どきどき","ドキドキ","トマト","ドラゴン","トラック","トランス","トリオ","ドリル","ドン","ない形","ナッツ","ニードル","ニコニコ","ニャー","ニュース","ニューヨーク","ニョロ","ネクタイ","ネット","パール","バーン","バイク","パイナップル","パウ","バス","パスタ","パスワード","パソコン","バター","バタバタ","バタフライ","バッグ","バッテリー","バット","バナナ","ハム","パラサイト","バリア","ハワイ","パン","ハンバーガー","ビートル","ピカ","ピクシー","ピザ","ビショビショ","ピッ","ビデオ","ひらがな","ビリビリ","ビル","ピンポン","ファイヤー","ファイル","ブー","ブースト","フーディーニ","フォルダ","プク","プス","プテラノドン","プライバシー","プラットフォーム","ブランド","フリーズ","プリン","プリンター","プレー","フワフワ","ペコペコ","ベタベタ","ベッド","ヘッドホン","ベトベト","ぺらぺら","ペラペラ","ペルシャ","ベロ","ポイント","ホーム","ホーン","ボタン","ポット","ポテト","ホテル","ポニー","ポリゴン","ボロボロ","マイク","マイン","マウス","まずい","ます形","ミス","ミニ","ミュー","ミルク","メール","メタモルフォーゼ","メニュー","メンバー","モニター","モルフォ","モンキー","もんじゃ","ユンゲラー","ヨーグルト","ラーメン","ライト","ライブ","ラジオ","ラッキー","ラット","ラプラス","ラフレシア","ら抜き言葉","リーダー","リザード","リンク","ルージュ","ルール","レア","レストラン","レモン","ログアウト","ログイン","ワクワク","ワン","ワンワン","愛知県","愛媛県","悪い","悪魔","安い","安全","暗い","暗証","案内","闇","以下","以上","位置","偉い","意見","意向形","意味","易しい","椅子","医者","育てる","一","一つ","一ページ","一時間","一体","一段動詞","壱","茨城県","印刷","引き受ける","引き上げる","引き返す","飲み比べる","飲み物","飲み歩く","飲む","飲食","右","雨","運","運ぶ","運転","運動","運命","雲","営む","影","映画","映画館","泳ぐ","英語","鋭い","駅","炎","猿","遠い","遠く","塩","汚い","汚れる","横浜駅","横浜市","王","王国","黄色い","岡山県","沖縄県","億","温かい","音","音楽","音読み","音量","下","下がる","下手","仮","仮定","仮定形","仮名","何","何でも","可愛い","可能形","夏","家","家族","果物","歌","火","稼ぐ","花","荷物","過ぎる","過去","画質","画面","会う","会議","会計","会社","会場","会話","解く","解放","壊れる","怪しい","怪竜","怪力","悔む","悔やむ","海","海月","海老原","開く","開ける","開始","階段","外","外す","概要","拡大","格闘","確認","覚える","覚める","覚醒","角","学ぶ","学校","学習","学生","楽しい","掛ける","割","割り振る","活用","活用形","滑らかい","兜","鎌倉市","鴨","寒い","感じる","漢","漢字","漢方","環境","甘い","管理","簡単","観光","間違える","関連動画","丸","丸い","眼鏡","岩","岩手県","顔","危ない","危機","危険","喜ぶ","嬉しい","岐阜県","希望","机","機内","気","気持ち","季節","規則","記憶","起きる","鬼","亀","偽物っぽい","技","議","客","逆鱗","休み","休む","休業","休憩","宮崎県","宮城県","急ぐ","急に","急上昇","泣き叫ぶ","泣く","牛","牛乳","去年","居間","魚","京都","京都駅","京都市","京都府","共有","協力し合う","強い","教える","橋","狭い","仰ぐ","玉","近い","近く","近所","金","銀行","九","九つ","九時","苦い","苦しい","駆け回る","空","空く","空ける","空間","空気","空港","空想","靴","熊本県","訓","訓読み","訓練","群馬県","軍","兄","契約","形","携帯","携帯電話","経験","経費","継ぐ","繋ぐ","計算","軽い","軽井沢町","迎える","決める","潔","結果","結界","月","健康","剣","建物","検索","権限","犬","研ぐ","研究","見","見せる","見つける","見つけ合わせる","見る","見合わせる","見失う","見切る","見送る","見直す","見届ける","鍵","元気","原因","厳しい","玄関","現在","言い合う","言語","言葉","限定公開","古い","呼び合う","呼ぶ","固い","固定","湖","狐","五","五つ","五段動詞","五秒","後ろ","語り合う","語る","語学","語幹","語尾","鯉","交差点","交通","光","光る","公園","公開","効く","厚い","口","向こう","広い","広島県","広島市","更新","甲","甲羅","硬い","考え","考える","行","行く","貢ぐ","鋼","降りる","香川県","高い","高さ","高知県","国","黒い","今月","今週","今日","今年","恨む","紺","魂","佐賀県","左","左右","差し上げる","砂糖","最強","最近","最後","最後に","最初","最初に","塞ぐ","細い","財布","咲く","埼玉県","削ぐ","削除","昨日","札幌市","雑誌","皿","三","三つ","三回","三時間","三重県","三日","三枚","傘","参","山","山形県","山口県","山梨県","散歩","残量","仕事","四","四つ","四角い","始める","姉","子","子ども","子供","思","指紋","支配","止む","止める","死","私","試し見る","試験","事","事件","事故","事故現場","似る","字幕","持ち出す","持ち上がる","持ち上げる","時","時間","時計","時刻","次","滋賀県","耳","自然","自転車","自動回転","自動再生","自動詞","自由","辞書","辞書形","鹿児島県","七","七つ","質問","写真","捨てる","社","社員","社長","車","蛇","借りる","若い","寂しい","弱々しい","弱い","取り合う","取り替える","取り入れる","取り戻す","取れる","手","手紙","手続き","種","首","受ける","受け止める","受け渡せる","受付","周り","拾","秋","秋田県","終える","終了","臭い","週末","集める","住む","住所","充電","十","柔らかい","渋滞","渋谷駅","重い","重さ","重要","銃","宿","宿題","縮む","出かける","出る","出会う","出口","出生","出発","春","準備","順番","初期化","暑い","書","書き換える","書き込み","書き足す","書き直す","書き直せる","書く","書類","助け合う","女","傷む","勝利","小さい","少ない","床","消える","焼く","省電力","詳しい","上","上がる","上手","上着","城","場合","場所","常","情報","色","触れる","触れ合う","食べる","食べ物","食べ歩く","食事","伸びる","信じる","信号","寝る","寝室","心","心強い","慎む","新しい","新潟県","新宿駅","新聞","森","深い","申し合わせる","申し上げる","申込","真実","真面目","神","神戸市","神奈川県","親切","身分証","辛い","進","進める","進化","人","人手","図書館","水","水道","数字","雀","世界","凄い","制限","成","成長","星","正しい","清","清い","清らかい","清音","清潔","生","生きる","生まれる","生む","生徒","精神","声","西","青い","青森県","青白い","静か","静岡県","石","石川県","積む","赤い","切り落とす","切手","切替","切符","接続","折り合う","設定","説明","雪","絶対","絶望","仙台市","先","先週","先生","千","千葉県","千葉市","川","川崎市","戦い","戦争","浅い","洗剤","洗濯","洗面所","羨ましい","選ぶ","選択","銭","前","全画面","全然","全部","粗い","素早い","組む","組織","掃除","早い","早く","漕ぐ","相談","窓","草","蒼い","送","送り仮名","送る","送信","送料","騒がしい","騒ぐ","憎い","促","促す","促音","促進","足","足りる","速度","続く","続ける","村","他動詞","多い","多く","太い","太陽","台所","大きい","大きさ","大阪駅","大阪市","大阪府","大丈夫","大人","大切","大分県","大変","第一","第五","第三","第四","第十","第二","沢山","沢村","濯ぐ","濁","濁る","濁音","叩く","脱ぐ","単独","単独の漢字","担ぐ","探し回る","探り回る","暖かい","男","値段","地域","地下鉄","地図","地面","恥ずかしい","池","置く","遅い","遅れる","茶色い","茶碗","着く","着る","着信音","中","仲間","昼","昼食","注ぐ","注意","注意書き","注文","虫","朝","朝食","町","調べる","超能力","長","長い","長さ","長音","長崎県","長野県","鳥","鳥取県","直ぐ","珍しい","追加","痛い","痛む","通","通常","通信","通知","通報","掴む","低い","定","庭","弟","程","敵","天","天井","天気","天使","店","店員","点数","伝える","伝説","電","電気","電車","電池","電話","電話番号","登録","登録済み","途中","都市","努力","土","土佐金","怒り","冬","刀","島根県","悼む","東","東京駅","東京都","答え","答える","到着","踏む","逃げ出す","働く","同期","道","道具","徳島県","特に","特別","毒","毒ガス","読","読み込み","読み返す","読む","読書","栃木県","届く","鈍い","奈良県","那覇市","謎","鍋","南","難しい","二","二つ","二個","二人","二点","二分","二本","弐","匂い","賑やか","肉","日","日光市","日付","日本語","入る","入学","入口","入力","任務","認める","認証","葱","猫","熱","熱い","年越し","悩む","能力","馬","敗北","買い替える","買い物","買う","売買","剥ぐ","博多駅","白","白い","白川郷","薄い","箱根町","箸","八","八つ","鳩","半","半ば","半濁音","半分","番号","番号札","番号順","彼","彼女","悲しい","比べる","皮","秘密","非公開","飛","飛び回る","飛び出す","飛ぶ","飛行","飛行機","美術館","美味しい","必ず","必殺技","必要","百","標準","氷","表示","病院","病気","品川駅","不","不思議","不便","付","付く","付ける","富む","富山県","布団","父","部","部屋","部屋代","部長","部品","封印","風","風呂","復元","復讐","幅","服","福井県","福岡県","福岡市","福島県","分","分かる","分け合う","文化","文法","聞き及ぶ","聞き取る","聞き直す","聞き逃す","聞き返す","聞く","聞こえる","兵庫県","兵士","平","平仮名","平気","平日","平和","並び替え","閉める","米","壁","壁紙","変える","変化","変身","片","片仮名","片付ける","片方","編む","編集","返信","便利","勉強","保険","保存","歩き回る","歩く","補助","母","包む","包丁","報告","抱く","方","方向","方法","法律","砲","褒める","帽子","忘れる","忙しい","忙しない","望む","紡ぐ","防ぐ","北海道","本","本棚","本当に","磨く","魔王","魔法","妹","毎月","毎日","万","味","味方","未だ","未来","眠い","夢","無線","無駄","無料","名古屋駅","名古屋市","名所","名乗る","名前","名付ける","命","命名","命令形","明るい","明るさ","明日","面白い","模型","木","目","目標","問題","夜","野菜","約束","薬","薬局","油","優しい","勇者","友","友達","有名","遊ぶ","郵便局","夕食","予定","予約","妖精","曜日","羊","葉","欲しい","浴びる","羅","来月","来週","来年","頼む","頼もしい","雷","落ちる","利用規約","履歴","理由","理由書","立ち寄る","立ち去る","竜","旅行","両","両親","料","料金","料理","良い","領収書","力","林","林檎","隣","例","例えば","冷たい","冷蔵庫","零","歴史","列","練","練習","連れ戻せる","連絡","廊下","老い","六","六つ","和","和歌山県","話","話しかける","話し合う","話す","歪む","嗅ぐ","噤む","悄む","拗音","撥音","鬱","滲む","眩しい","睨む","礫","綺麗","萬","蕾","蜥蜴","阡","黴"]
    },
    {
      "name": "jp_labels",
      "description": "Unique values from collections/**/_metadata.json fields[].jp_label.",
      "sources": [
        "collections"
      ],
      "unique_words_count": 48,
      "unique_words": ["おおよその年代","ギリシャ語発音","ギリシャ名","クラス","タイプ","タグ","チャンク","メモ","ラテン語発音","ラテン名","リンク","圧縮定義","意味","英語名","英訳","外見","漢字","言語","古典ギリシャ語名","語彙クラス","使用状況 / 文脈","時代 / 期間","種類","出典","小文字","図鑑番号","数","代表的な文献","大文字","担当領域","定義","読み","日本語","日本語名","能力","発音 / 音声学","備考","備考 / 発音","表記","文字","文字体系 / 正書法","文法 / 形態論","文法ノート","補足","名前ルーツ","用語","例","例文 / 発音例"],
      "missing_kanji_definition_count": 40,
      "missing_kanji_definition": [
        "おおよその年代",
        "ギリシャ語発音",
        "ギリシャ名",
        "タイプ",
        "タグ",
        "チャンク",
        "メモ",
        "ラテン語発音",
        "ラテン名",
        "圧縮定義",
        "英語名",
        "英訳",
        "外見",
        "古典ギリシャ語名",
        "語彙クラス",
        "使用状況 / 文脈",
        "時代 / 期間",
        "種類",
        "出典",
        "小文字",
        "図鑑番号",
        "数",
        "代表的な文献",
        "大文字",
        "担当領域",
        "定義",
        "読み",
        "日本語名",
        "発音 / 音声学",
        "備考",
        "備考 / 発音",
        "表記",
        "文字",
        "文字体系 / 正書法",
        "文法 / 形態論",
        "文法ノート",
        "補足",
        "名前ルーツ",
        "用語",
        "例文 / 発音例"
      ]
    },
    {
      "name": "pokemon_types",
      "description": "Unique values from collections/pokemon/**.json entries[].type (string or array).",
      "sources": [
        "collections/pokemon"
      ],
      "unique_words_count": 17,
      "unique_words": ["ゴースト","ドラゴン","炎","格闘","岩","鋼","水","草","地面","虫","超能力","通常","電気","毒","飛行","氷","妖精"]
    },
    {
      "name": "pokemon_roots",
      "description": "Unique values from collections/pokemon/**.json entries[].japaneseNameRoots (string or array).",
      "sources": [
        "collections/pokemon"
      ],
      "unique_words_count": 155,
      "unique_words": ["EV","インセクト","ウインド","エレクトリック","オウム","オウムガイ","ガード","カイロス","カラ","ガラ","カンガルー","キャタピラー","ギャロップ","キング","クイーン","クラブ","ケーシー","ゲンガー","ケンタウロス","コイル","ゴー","ゴースト","ゴール","ゴールド","ゴーレム","コクーン","ゴロゴロ","サイ","サンダー","サンド","シー","シェル","シャワー","ジュゴン","スター","ストライク","ズバ","スピア","スリープ","セル","ダグ","ダック","チュウ","ツー","ディグ","ドードー","ドラゴン","トランス","トリオ","ドリル","ドン","ナッツ","ニードル","ニャー","ニョロ","パール","パウ","バタフライ","バット","パラサイト","バリア","パン","ビートル","ピカ","ピクシー","ピッ","ビリビリ","ファイヤー","ブー","ブースト","フーディーニ","プク","プス","プテラノドン","フリーズ","プリン","ベトベト","ペルシャ","ベロ","ホーン","ポット","ポニー","ポリゴン","マイン","また","ミニ","ミュー","メタモルフォーゼ","モルフォ","モンキー","もんじゃ","ユンゲラー","ラッキー","ラット","ラプラス","ラフレシア","リザード","ルージュ","レア","ワン","猿","王","火","花","怪竜","怪力","海月","海老原","兜","鴨","丸","岩","鬼","亀","逆鱗","玉","九","狐","鯉","甲羅","紺","子","蛇","種","臭い","宿","人手","雀","星","石","銭","草","沢村","土佐金","怒り","東","毒","毒ガス","謎","葱","白","鳩","不思議","砲","未だ","目","雷","竜","力","六","鬱","礫","蕾","蜥蜴","黴"],
      "missing_kanji_definition_count": 1,
      "missing_kanji_definition": [
        "また"
      ]
    },
    {
      "name": "japanese_sentence_refs",
      "description": "Unique values from collections/japanese/**.json sentences[].chunks[].refs[].",
      "sources": [
        "collections/japanese/examples"
      ],
      "unique_words_count": 129,
      "unique_words": ["Wi-Fi","アプリ","ウイルス","お金","カフェ","キラキラ","コート","コーヒー","こと","シャツ","すぐ","ずっと","スマホ","する","たくさん","ドキドキ","ニューヨーク","バッグ","ハワイ","フーディーニ","プテラノドン","フリーズ","プリン","りんご","一ページ","一時間","一体","泳ぐ","駅","何でも","家","家族","稼ぐ","会議","海","開く","概要","学校","寒い","急ぐ","京都","仰ぐ","九時","空く","経費","繋ぐ","迎える","決める","犬","研ぐ","研究","見せる","見る","五秒","光る","行く","貢ぐ","削ぐ","三つ","三回","三時間","三日","三枚","始める","子供","私","試験","時間","自転車","質問","写真","手","手紙","終える","住所","書く","水","星","生きる","説明","先生","前","漕ぐ","窓","騒ぐ","続ける","多く","濯ぐ","脱ぐ","地図","遅い","中","注ぐ","朝","調べる","伝える","努力","東京駅","答える","二個","二人","二点","二分","二本","入る","認める","剥ぐ","彼","彼女","比べる","皮","部屋","分かる","聞く","勉強","包丁","褒める","防ぐ","毎月","無駄","模型","夜","友だち","浴びる","両親","料理","冷たい","話","嗅ぐ"],
      "missing_kanji_definition_count": 5,
      "missing_kanji_definition": [
        "こと",
        "すぐ",
        "たくさん",
        "りんご",
        "友だち"
      ]
    }
  ]
}
