{
  "generatedAt": "2026-02-01T22:59:19.070Z",
  "searchPatterns": [
    {
      "name": "japanese_entries_kanji",
      "description": "Unique values from collections/japanese/**.json entries[].kanji.",
      "sources": [
        "collections/japanese"
      ],
      "unique_words_count": 983,
      "unique_words": ["アイスクリーム","アカウント","アプリ","イス","イヤホン","イライラ","いる","ウロウロ","エレベーター","オレンジ","お金","お茶","お釣り","カード","ガス","カタカナ","カチカチ","かばん","カフェ","カメラ","カラー","ガラガラ","カレー","キーボード","きつい","キャップ","キャンディ","キラキラ","グチャグチャ","クッキー","クラス","グレープ","ケーキ","ケーブル","ゲーム","コート","コード","コーヒー","コツコツ","コピー","ゴロゴロ","コンビニ","コンピューター","ご飯","サービス","サイズ","サイト","サラサラ","サラダ","サンドイッチ","シーン","ジャーン","ジャケット","シャツ","シャワー","ジュース","ショップ","スーツ","スーパー","スープ","スカート","ズキズキ","ステーキ","スナック","スニーカー","スピーカー","スポーツ","ズボン","スマートフォン","セーター","セール","ソース","ソーセージ","ソファ","ソフト","タオル","タクシー","だるい","た形","チーズ","チーム","チケット","チップ","チュウ","チョコレート","チラチラ","つまらない","ティー","データ","テーブル","できる","デザート","デザイン","テスト","テレビ","て形","ドア","トイレ","ドーン","ドキドキ","トマト","トラック","トランス","ない形","ニコニコ","ニャー","ネクタイ","ネット","バーン","バイク","パイナップル","バス","パスタ","パスワード","パソコン","バター","バタバタ","バッグ","バッテリー","バナナ","ハム","パン","ハンバーガー","ピカ","ピザ","ビショビショ","ビデオ","ひらがな","ビル","ピンポン","ファイル","フォルダ","プラットフォーム","ブランド","プリンター","プレー","フワフワ","ペコペコ","ベタベタ","ベッド","ヘッドホン","ペラペラ","ポイント","ホーム","ボタン","ポテト","ホテル","ボロボロ","マイク","マウス","まずい","ます形","ミス","ミルク","メール","メニュー","メンバー","モニター","ヨーグルト","ラーメン","ライト","ラジオ","ら抜き言葉","リーダー","リンク","ルール","レストラン","レモン","ワクワク","ワンワン","悪い","安い","安全","暗い","案内","以下","以上","偉い","意見","意向形","意味","易しい","椅子","医者","育てる","一段動詞","引き受ける","引き上げる","引き返す","飲み比べる","飲み物","飲み歩く","飲む","飲食","右","雨","運ぶ","運転","運動","雲","営む","映画","映画館","泳いだ","泳いで","泳がない","泳ぎます","泳ぐ","泳げる","泳ごう","英語","鋭い","駅","炎","遠い","遠く","塩","汚い","汚れる","黄色い","温かい","音楽","音読み","下","下がる","下手","仮","仮定","仮定形","仮名","何","可愛い","可能形","夏","家","家族","果物","歌","火","稼いだ","稼いで","稼がない","稼ぎます","稼ぐ","稼げる","稼ごう","花","荷物","過ぎる","画面","会う","会議","会計","会社","会場","会話","解く","壊れる","怪しい","悔む","悔やむ","海","開く","開ける","開始","階段","外","外す","確認","覚える","覚める","角","学ぶ","学校","学習","学生","楽しい","掛ける","割り振る","活用","活用形","滑らかい","寒い","感じる","漢","漢字","漢方","環境","甘い","簡単","観光","間違える","丸い","眼鏡","危ない","危険","喜ぶ","嬉しい","希望","机","気","気持ち","季節","規則","起きる","亀","偽物っぽい","議","客","休み","休む","休業","休憩","急いだ","急いで","急がない","急ぎます","急ぐ","急げる","急ごう","泣き叫ぶ","泣く","牛","牛乳","去年","居間","魚","協力し合う","強い","教える","橋","狭い","仰ぐ","近い","近く","近所","金","銀行","苦い","苦しい","駆け回る","空","空く","空ける","空気","空港","空想","靴","訓","訓読み","訓練","兄","契約","形","携帯","携帯電話","経験","継ぐ","繋いだ","繋いで","繋がない","繋ぎます","繋ぐ","繋げる","繋ごう","計算","軽い","迎える","決める","潔","結果","月","健康","建物","犬","研いだ","研いで","研がない","研ぎます","研ぐ","研げる","研ごう","見","見せる","見つける","見つけ合わせる","見る","見合わせる","見失う","見切る","見送る","見直す","見届ける","鍵","元気","原因","厳しい","玄関","言い合う","言葉","古い","呼び合う","呼ぶ","固い","湖","五段動詞","後ろ","語り合う","語る","語学","語幹","語尾","交差点","交通","公園","効く","厚い","口","向こう","広い","甲","甲羅","硬い","考え","考える","行","行く","貢ぐ","降りる","高い","高さ","国","黒い","今月","今週","今日","今年","恨む","左","左右","差し上げる","砂糖","最後","最初","塞ぐ","細い","財布","咲く","削ぐ","昨日","雑誌","皿","傘","山","散歩","仕事","四角い","始める","姉","子","子ども","思","止む","止める","試し見る","試験","事故","事故現場","似る","持ち出す","持ち上がる","持ち上げる","時","時間","時計","耳","自然","自転車","自動詞","自由","辞書形","質問","写真","捨てる","社","社員","社長","車","借りる","若い","寂しい","弱々しい","弱い","取り合う","取り替える","取り入れる","取り戻す","取れる","手紙","手続き","種","首","受ける","受け止める","受け渡せる","受付","周り","秋","終える","終了","臭い","週末","集める","住む","住所","充電","柔らかい","渋滞","重い","重さ","重要","宿題","縮む","出かける","出る","出会う","出口","出生","出発","春","準備","順番","暑い","書","書き換える","書き込み","書き足す","書き直す","書き直せる","書く","書類","助け合う","女","傷む","小さい","少ない","床","消える","焼く","詳しい","上","上がる","上手","上着","場合","場所","常","色","触れる","触れ合う","食べる","食べ物","食べ歩く","食事","伸びる","信じる","信号","寝る","寝室","心","心強い","慎む","新しい","新聞","森","深い","申し合わせる","申し上げる","申込","真面目","親切","身分証","辛い","進","進める","人","図書館","水","水道","数字","世界","凄い","成","成長","星","正しい","清","清い","清らかい","清音","清潔","生","生きる","生まれる","生む","声","西","青い","青白い","静か","積む","赤い","切り落とす","切手","切符","折り合う","設定","説明","雪","先","先週","先生","川","浅い","洗剤","洗濯","洗面所","羨ましい","選ぶ","銭","前","粗い","素早い","組む","掃除","早い","漕ぐ","相談","窓","草","蒼い","送","送り仮名","送る","送料","騒いだ","騒いで","騒がしい","騒がない","騒ぎます","騒ぐ","騒げる","騒ごう","憎い","促","促す","促音","促進","足","足りる","続く","続ける","村","他動詞","多い","太い","太陽","台所","大きい","大きさ","大丈夫","大人","大切","大変","濯いだ","濯いで","濯がない","濯ぎます","濯ぐ","濯げる","濯ごう","濁","濁る","濁音","叩く","脱いだ","脱いで","脱がない","脱ぎます","脱ぐ","脱げる","脱ごう","単独","単独の漢字","担ぐ","探し回る","探り回る","暖かい","男","値段","地下鉄","地図","恥ずかしい","池","置く","遅い","遅れる","茶色い","茶碗","着く","着る","中","昼","昼食","注いだ","注いで","注がない","注ぎます","注ぐ","注げる","注ごう","注意","注意書き","注文","虫","朝","朝食","町","調べる","長","長い","長さ","長音","鳥","珍しい","痛い","痛む","通","通常","掴む","低い","定","庭","弟","天","天井","天気","店","店員","点数","伝える","電","電気","電車","電池","電話","電話番号","途中","努力","土","冬","悼む","東","答え","答える","到着","踏む","逃げ出す","働く","道","道具","特別","毒","読","読み返す","読む","読書","届く","鈍い","鍋","南","難しい","匂い","賑やか","肉","日","日本語","入学","入口","認める","猫","熱","熱い","年越し","悩む","馬","買い替える","買い物","買う","売買","剥ぐ","白い","薄い","箸","半","半ば","半濁音","半分","番号","番号札","番号順","悲しい","比べる","飛","飛び回る","飛び出す","飛ぶ","飛行","飛行機","美術館","美味しい","必要","病院","病気","不","不思議","不便","付","付く","付ける","富む","布団","父","部","部屋","部屋代","部長","部品","風","風呂","幅","服","分","分け合う","文化","文法","聞き及ぶ","聞き取る","聞き直す","聞き逃す","聞き返す","聞く","聞こえる","平","平仮名","平気","平日","平和","閉める","米","壁","変える","変化","片","片付ける","片方","編む","便利","勉強","保険","歩き回る","歩く","母","包む","包丁","抱く","方","方向","方法","法律","砲","褒める","帽子","忘れる","忙しい","忙しない","望む","紡ぐ","防いだ","防いで","防がない","防ぎます","防ぐ","防げる","防ごう","本","本棚","磨く","妹","毎日","味","眠い","夢","無料","名所","名乗る","名前","名付ける","命名","命令形","明るい","明日","面白い","木","目標","問題","夜","野菜","約束","薬","薬局","油","優しい","友","友達","有名","遊ぶ","郵便局","夕食","予定","予約","曜日","羊","葉","欲しい","浴びる","羅","来月","来週","来年","頼む","頼もしい","雷","落ちる","理由","理由書","立ち寄る","立ち去る","旅行","両親","料","料金","料理","良い","領収書","林","隣","例","冷たい","冷蔵庫","歴史","列","練","練習","連れ戻せる","連絡","廊下","老い","和","話しかける","話し合う","話す","歪む","嗅ぐ","噤む","悄む","拗音","撥音","滲む","眩しい","睨む","綺麗","蜥蜴"]
    },
    {
      "name": "jp_labels",
      "description": "Unique values from collections/**/_metadata.json fields[].jp_label.",
      "sources": [
        "collections"
      ],
      "unique_words_count": 43,
      "unique_words": ["おおよその年代","ギリシャ語発音","ギリシャ名","クラス","タイプ","タグ","ラテン語発音","ラテン名","リンク","圧縮定義","意味","英語名","外見","漢字","言語","古典ギリシャ語名","使用状況 / 文脈","時代 / 期間","種類","出典","小文字","図鑑番号","数","代表的な文献","大文字","担当領域","定義","読み","日本語名","能力","発音 / 音声学","備考","備考 / 発音","表記","文字","文字体系 / 正書法","文法 / 形態論","補足","名前ルーツ","用語","例","例文","例文 / 発音例"]
    },
    {
      "name": "pokemon_types",
      "description": "Unique values from collections/pokemon/**.json entries[].type (string or array).",
      "sources": [
        "collections/pokemon"
      ],
      "unique_words_count": 17,
      "unique_words": ["ゴースト","ドラゴン","炎","格闘","岩","鋼","水","草","地面","虫","超能力","通常","電気","毒","飛行","氷","妖精"]
    },
    {
      "name": "pokemon_roots",
      "description": "Unique values from collections/pokemon/**.json entries[].japaneseNameRoots (string or array).",
      "sources": [
        "collections/pokemon"
      ],
      "unique_words_count": 155,
      "unique_words": ["EV","インセクト","ウインド","エレクトリック","オウム","オウムガイ","ガード","カイロス","カラ","ガラ","カンガルー","キャタピラー","ギャロップ","キング","クイーン","クラブ","ケーシー","ゲンガー","ケンタウロス","コイル","ゴー","ゴースト","ゴール","ゴールド","ゴーレム","コクーン","ゴロゴロ","サイ","サンダー","サンド","シー","シェル","シャワー","ジュゴン","スター","ストライク","ズバ","スピア","スリープ","セル","ダグ","ダック","チュウ","ツー","ディグ","ドードー","ドラゴン","トランス","トリオ","ドリル","ドン","ナッツ","ニードル","ニャー","ニョロ","パール","パウ","バタフライ","バット","パラサイト","バリア","パン","ビートル","ピカ","ピクシー","ピッ","ビリビリ","ファイヤー","ブー","ブースト","フーディーニ","プク","プス","プテラノドン","フリーズ","プリン","ベトベト","ペルシャ","ベロ","ホーン","ポット","ポニー","ポリゴン","マイン","また","ミニ","ミュー","メタモルフォーゼ","モルフォ","モンキー","もんじゃ","ユンゲラー","ラッキー","ラット","ラプラス","ラフレシア","リザード","ルージュ","レア","ワン","猿","王","火","花","怪竜","怪力","海月","海老原","兜","鴨","丸","岩","鬼","亀","逆鱗","玉","九","狐","鯉","甲羅","紺","子","蛇","種","臭い","宿","人手","雀","星","石","銭","草","沢村","土佐金","怒り","東","毒","毒ガス","謎","葱","白","鳩","不思議","砲","未だ","目","雷","竜","力","六","鬱","礫","蕾","蜥蜴","黴"]
    }
  ]
}
