{
  "category": "japanese.sentences",
  "description": "Japanese sentences structured as learner-optimized reading chunks with local grammar focus and vocabulary references.",
  "version": 1,
  "fields": [
    {
      "key": "ja",
      "label": "Japanese",
      "jp_label": "日本語",
      "type": "string",
      "required": true,
      "description": "Full Japanese sentence in natural surface form."
    },
    {
      "key": "en",
      "label": "English",
      "jp_label": "英訳",
      "type": "string",
      "required": true,
      "description": "Natural English translation conveying overall meaning rather than literal structure."
    },
    {
      "key": "notes",
      "label": "Notes",
      "jp_label": "メモ",
      "type": "array<string>",
      "required": false,
      "description": "Instance-only notes: sentence-specific nuance, context assumptions, naturalness warnings, or culture/pragmatics tied to this exact sentence. Do NOT restate general grammar rules (use `grammarNotes`) or general vocabulary definitions (use word entries)."
    },
    {
      "key": "grammarNotes",
      "label": "Grammar Notes",
      "jp_label": "文法ノート",
      "type": "array<string>",
      "required": false,
      "description": "High-value grammar recognition notes and common contrast pairs relevant to patterns appearing in this sentence. Prefer short disambiguation insights that help learners distinguish easily confused structures (e.g., Vてきた vs Vていく, ので vs から). Avoid sentence-specific nuance or long theoretical explanations; those belong in `notes`."
    },
    {
      "key": "chunks",
      "label": "Chunks",
      "jp_label": "チャンク",
      "type": "array<sentenceChunk>",
      "required": true,
      "description": "Ordered learner-optimized reading units composing the sentence. Each chunk may contain its own focus and references."
    }
  ],
  "types": {
    "sentenceChunk": {
      "description": "A learner reading unit inside a sentence. Every chunk must link to at least one non-particle reference (content word or grammar pattern). Do not include particles in refs.",
      "fields": [
        {
          "key": "ja",
          "label": "Chunk Japanese",
          "jp_label": "チャンク日本語",
          "type": "string",
          "required": true,
          "description": "Japanese surface text for this chunk exactly as it appears in the sentence."
        },
        {
          "key": "gloss",
          "label": "Gloss",
          "jp_label": "意味",
          "type": "string",
          "required": true,
          "description": "Short learner-friendly meaning/paraphrase for this chunk."
        },
        {
          "key": "focus",
          "label": "Grammar Focus",
          "jp_label": "文型",
          "type": "string",
          "required": false,
          "description": "Canonical grammar/pattern label if this chunk targets a structure (e.g., 'AながらB', 'Vていく')."
        },
        {
          "key": "refs",
          "label": "References",
          "jp_label": "参照語",
          "type": "array<string>",
          "required": true,
          "description": "REQUIRED, NON-EMPTY. Must include at least one lookup key for a content word or grammar pattern used in this chunk. Do NOT include particles (は/が/を/に/で/と/へ/も/や/の/ね/よ/か etc.). Authoring rule: do not create particle-only chunks; attach particles to an adjacent chunk that contains a referencable item."
        }
      ]
    }
  }
}